data_generation/Data_Generation_Model/Check/0/yWall
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "3000";
    object      yWall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
20540
(
0.183464
0.0293077
0.183464
0.0564637
0.183464
0.0564637
0.183464
0.0564638
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform 1e-15;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
