data_generation/Data_Generation_Model/Check/system/sampleCp
type            patchProbes;
libs            ("libsampling.so");
writeControl    writeTime;

patch           lowerWall;
probeLocations  ();
fields          (cp);

