data_generation/Data_Generation_Model/Check/system/stressComponents
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;

fields          (devReff);

